// Да се напише рекурзивна функција f() која за даден природен број ќе го пресмета
// и враќа збирот на сите цифри кои се наоѓаат на парни позиции (гледано од десно кон лево).
// Се смета дека најмалку значајната цифра е на 1-ва позиција.
// Потоа да се напише програма која за даден природен број n (што се внесува од тастатура)
// ќе ја повика функцијата f() за да го испечати збирот на цифрите кои се наоѓаат на парни позиции во n.

#include <iostream>

using namespace std;

int f(int broj) {
    if (broj == 0)
        return 0;
    return broj % 10 + f(broj / 100);
}

int main() {
    int n;
    cin >> n;
    cout << f(n / 10);
    return 0;
}
