// Да се напише рекурзивна функција која што прима еден аргумент -
// број x која што ќе враќа 1 доколку секоја цифра во бројот е поголема од претходната, а во спротивно 0.
// Пример бројот 12345 е растечки, додека пак бројот 12325 не е растечки број.
// Од стандарден влез се вчитува прво број N, а потоа N броеви.
//За секој број да се испечати порака DA или NE (во нов ред), доколку бројот е растечки или не е растечки.

#include <iostream>

using namespace std;

bool rastecka(int x) {
    if (x < 10) {
        return true;
    }
    if (x < 100) {
        return x % 10 > x / 10 % 10;
    }
    if (x % 10 > x / 10 % 10 == rastecka(x / 10)) {
        return x % 10 > x / 10 % 10;
    } else
        return false;
}

int main()
{
    int n,broj;
    cin>>n;
    for (int i = 0; i < n; ++i) {
        cin>>broj;
        cout<<rastecka(broj)<<endl;
    }
    return 0;
}