/*Среден број е број кај кој секоја следна цифра е помала на претходната (гледајќи од најзначајната кон најмалку значајната).
 * На пример, 7421. Едноцифрените броеви не се средни броеви.

Да се напише програма во која прво се внесува број N кој го определува вкупниот број на броеви кои ќе бидат внесени од тастатура.
Потоа се внесуваат N-те броеви, еден по еден. На излез, потребно е да се испечатат сите броеви кои го исполнуваат условот за среден број,
 а потоа да се отпечати и минималниот среден број од внесените броеви.

Доколку не постои број кој го задоволува условот се печати вредност -1.

Пример за влез:

5
435
643
12234
721
7720

Пример за излез:

643
721
643*/

#include <iostream>
using namespace std;

int main() {
    int num, i, temp, min = -1, N;
    cin >> N;

    for (i = 0; i < N; i++) {
        cin >> num;
        temp = num;
        while (temp > 9) {
            if (temp % 10 >= (temp / 10) % 10)
                break;
            temp /= 10;
        }
        if (temp < 10) {
            cout << num << endl;
            if (min == -1)
                min = num;
            else
                if (num < min)
                    min = num;
        }
    }
    cout << min;
    return 0;
}