//Еден желка-робот може да се движи низ рамнина само во насока паралелна на оските (x и y) и да ротира околу тековната
// позиција за 90º и тоа или налево или надесно. На почетокот желката е позиционирана во координатниот почеток и е
// свртена нагоре (гледа во правец на позитивната насока на y оската). Од тастатура се внесуваат командите за движење
// на роботот како низа од знаците ‘F’, ‘R’ и ‘L’ кои значат F –чекор напред, R –заврти се во десно и L –заврти се во
// лево. Напишете програма која ќе ја отпечати финалната позиција на желката (како пар целобројни координати x, y) по
// извршената серија на команди. Серијата команди завршува со кој било знак кој не е ‘F’, ‘R’ или ‘L’. (Со командите
// ‘L’ и ‘R’ не се изведува чекор, само се менува насоката во која е свртена желката.)

#include <iostream>
#include <cstring>

using namespace std;

int main() {
    int x = 0, y = 0;
    int stepx[] = {0, -1, 0, 1};
    int stepy[] = {1, 0, -1, 0};
    int dir = 0; // heading direction 0..3 (0 = up)
    char c;
    c = cin.get();
    while (strchr("FRLfrl", c) != NULL) {
        switch (toupper(c)) {
            case 'R': {
                dir += 3; // dir--; dir += 4;
                dir %= 4;
                break;
            }
            case 'L': {
                dir++;
                dir %= 4;
                break;
            }
            case 'F': {
                x += stepx[dir];
                y += stepy[dir];
                break;
            }
        }
        c = cin.get();
    }
    cout << x << ' ' << y << endl;
    return 0;
}